### 前言
---
從國中開始，大部分時間都沉迷於手遊，我就越來越不喜歡讀書，除了有練習畫畫之外國中真的蠻廢的，我其實很羨慕那些會讀書玩遊戲也很厲害的人。

在會考完之後，成績當然也很差，在選志願的時候也沒什麼想法，因為我真的不知道自己的興趣是什麼，最後聽從了家人的建議，選了社會期望高的資訊科為第一志願，最後上了某私立高中的資訊科。

### 日常生活
---
私立高中總是讓人覺得管很嚴，或是校規很多，沒錯我的高中就是這樣，校規包括不能染髮、頭髮長度也有規定，服裝整齊還有就是穿外套不能露出裡面的衣服(通常是背後很容易被發現)，到校後不能使用手機(若要使用則須申請)等等規則，違者輕則警告一支，重則小過，且只要有過失就會拿到一張「本校特產」-自述表(通稱悔過書)。

高中三年都是每天早上6:00起床整理裝容+吃早餐後到校，到校後學校裡會有糾察隊，他們會巡邏觀察我們身上的服裝儀容，只要不符合校規就會被開罰單，這個罰單有兩張，一張會送到教官室，一張會送到班導手上，只要有被開就是警告一支+自述表。

大概7:20會開始打掃教室，8:00之後開始早自修，早自修期間會有檢查打掃環境的糾察隊開始進每一間教室巡視，只要他發現那些地方有不乾淨的或不符合校規的，就會被「登記」，一樣會被開罰單，然後班導會要求衛生股長去查被登記到不合格範圍的負責人開警告一支+自述表。

只要班上有人出狀況，班導就會在早自修開始訓話，高一的時候這種狀況很容易發生，因為大家都還不適應這個制度，所以每天早自修都非常不平靜。

先來介紹一下我們的班導師(代稱老王)，她是教數學的，她的經典名言:「拜託，我只是教數學的」，但她很care我們的每一件事，包括品行、口德還有學習態度等，她甚麼都會管，而且其他專任科目老師都跟她很熟，只要學生出狀況就會向老王告狀，學生在被一位老師處理完之後，接著就換老王處理，只要班上發生的每一件事老王都會參一腳。

### 高一
---
Ok，我在高一的時候，學的專業科目有電子學、基本電學等，基本電學每一次上課都會先小考，題目為上一次教的內容，只要低於老師的幾個標準，就會要求你放學後留班補考。

我還是延續國中的學習態度，幾乎呈現放棄學習的狀態，所以補考名單都一定有我的名字，但我已經習以為常了，補考前才開始抱佛腳複習，我每次都抱著僥倖心態通過考試。

其他科目我也一樣在混，段考幾乎都用猜的。但是在高一下最後一次段考，大家公認最難的電子學我竟然考全班最高分，但我自己知道我是猜中才得分的，心裡並沒有太高興，我一直看著那張88分的考卷，看我猜對的那幾題，然後開始去翻課本看類似的題目，才發現有幾題跟課本上的例題一摸一樣，而且計算也沒有很複雜，想說X老師也出太簡單了吧。

### 108課綱的白老鼠
---
我們是第一屆108課綱的實施對象，這個政策主張跳脫這個政策主張跳脫考試成績的框架，去發展自己的多元能力，但我們教育體制還是已考試成績為重，老師連專業科目都教不完了，更何況叫我們去發展多元技能。

這個政策的核心就是「學習歷程」，已就是申請大學的備審資料，我們都是做一步算一步，因為也沒人知道該怎麼做比較好，只要有特殊活動就拿來做了。

### 高二
---
在電子學猜到全班最高之後，我開始思考我的學習態度，有些同學都說現在學的專業科目很難所以就放棄學，當時我也跟著一起擺爛，但後來想想，我都還沒試過就放棄那就什麼事也不會發生，於是高二開始嘗試去讀看看電子學，第一次段考的題目跟我預料到的一樣，老師並沒有出太難的題目，於是我寫的很順，基本電學也是，在二上之後就沒有被留班過了，之後越來越有自信去讀書。

我還記得有一數學作業太難都不會寫，而且我盡力嘗試去寫，但老王對了答案，有錯就直接劃掉，那次全部都寫錯然後就被他質問說:「你有重補修過嗎?」我想了想說:「沒有」，她之後說:「數學補考全冊!]，我當下聽了其實很不爽，我心想我TM到時候就證明給妳看我不會被當，最後一次段考數學90幾忘了。

到二下之後，疫情開始爆發，全台學生都被趕回家⋯

### 疫情時期
---
被趕回家之後，基本上都是睡到自然醒，只要在上課前進線上教室就好，但有人就是會睡過頭，然後點名未到，就直接被賞賜自述表，那時寫完就拍照傳給老王看。

我在疫情初期一度有回到以前的耍廢態度，因為家裡真的太多誘惑🥹，但老王的要求沒有停止過，我之後就一直崩緊神經，感覺在家上課還比較痛苦😖，而且作業都是拍照上傳，那時候手機相簿裡全部都是作業的照片，有幾次拍的照片有些小地方模糊就被幹譙🤣。

印象中疫情除了學校的事之外，真的是個糜爛的時光，我很後悔沒有在那段時間做自己喜歡的事情。

### 高三
---

升上高三後就是全力拚統測，平日除了課輔之外多了兩小時的夜自習，所有科目都進了複習階段。

那時候參加夜自習只是為了報心安的，有跟大家一起寫歷屆試題，但寫沒多久就開始分心，可能一整天的體力無法撐到這麼晚，於是我就偷偷帶其他課外書，別人在認真寫題目，而我在看其他書 哈哈🤣

反正我能複習的就盡力去複習，沒體力的話就休息，我也只能這樣做了。我們考了好幾次模擬考，和全台灣的統測生比較才知道自己的渺小...但我之後也沒更認真就是了。

### 功過紀錄
---
我幾乎沒什麼功可以說，三年下來到畢業，累積警告4支，自述表六張，0大、小過，我認為我真的算幸運的，沒有被抓到服儀不整，大多數都是作業忘了帶被記，然後有幾次是逾時回覆老師的訊息。
